Revit 2024 API
BasePoint.GetSurveyPoint Method
 Gets the survey point for the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.2
Syntax
C#
public static BasePoint GetSurveyPoint(
	Document cda
)
Visual Basic
Public Shared Function GetSurveyPoint ( _
	cda As Document _
) As BasePoint
Visual C++
public:
static BasePoint^ GetSurveyPoint(
	Document^ cda
)
Parameters
cda
Type: Autodesk.Revit.DB.Document
 The document from which to get the survey point.
Return Value
 The survey point of the document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BasePoint Class
Autodesk.Revit.DB Namespace